mdbsliguo/stm32_template_SPL/Examples/ADC/ADC01_SingleChannelVoltage/board.h
/**
 * @file board.h
 * @brief 硬件配置头文件（案例ADC01独立工程专用）
 * @details 此文件包含案例ADC01所需的硬件配置
 * 
 * 注意：这是独立工程的board.h，包含案例所需的硬件配置
 */

#ifndef BOARD_H
#define BOARD_H

#include "stm32f10x.h"
#include <stdint.h>

/* ==================== ADC配置 ==================== */

/* ADC配置结构体 */
typedef struct
{
    ADC_TypeDef *adc_periph;  /**< ADC外设（ADC1） */
    uint8_t channels[16];     /**< ADC通道数组（ADC_Channel_0 ~ ADC_Channel_17） */
    uint8_t channel_count;    /**< 通道数量（1-16） */
    uint8_t sample_time;      /**< 采样时间：ADC_SampleTime_1Cycles5 ~ ADC_SampleTime_239Cycles5 */
    uint8_t enabled;          /**< 使能标志：1=启用，0=禁用 */
} ADC_Config_t;

/* ADC统一配置表 - 案例ADC01配置（ADC1，PA0，单通道） */
#define ADC_CONFIGS {                                                                                    \
    {ADC1, {ADC_Channel_0}, 1, ADC_SampleTime_55Cycles5, 1}, /* ADC1：PA0，单通道，55.5周期采样，启用 */ \
}

/* ==================== UART配置 ==================== */

/* UART配置结构体 */
typedef struct
{
    USART_TypeDef *uart_periph;        /**< UART外设（USART1/USART2/USART3） */
    GPIO_TypeDef *tx_port;              /**< TX引脚端口 */
    uint16_t tx_pin;                    /**< TX引脚号 */
    GPIO_TypeDef *rx_port;              /**< RX引脚端口 */
    uint16_t rx_pin;                    /**< RX引脚号 */
    uint32_t baudrate;                  /**< 波特率（Hz），常用值：9600, 115200等 */
    uint16_t word_length;                /**< 数据位：USART_WordLength_8b或USART_WordLength_9b */
    uint16_t stop_bits;                  /**< 停止位：USART_StopBits_1或USART_StopBits_2 */
    uint16_t parity;                     /**< 校验位：USART_Parity_No、USART_Parity_Even或USART_Parity_Odd */
    uint8_t enabled;                    /**< 使能标志：1=启用，0=禁用 */
} UART_Config_t;

/* UART统一配置表 - 标准配置：USART1，PA9/PA10，115200，8N1 */
#define UART_CONFIGS {                                                                                    \
    {USART1, GPIOA, GPIO_Pin_9, GPIOA, GPIO_Pin_10, 115200, USART_WordLength_8b, USART_StopBits_1, USART_Parity_No, 1}, /* UART1：PA9(TX), PA10(RX)，115200，8N1，启用 */ \
}

/* ==================== LED配置 ==================== */

/* LED配置结构体 */
typedef struct
{
    GPIO_TypeDef *port;   /**< GPIO端口基地址 */
    uint16_t pin;         /**< 引脚号 */
    uint8_t active_level; /**< 有效电平（Bit_SET或Bit_RESET） */
    uint8_t enabled;      /**< 使能标志：1=启用，0=禁用 */
} LED_Config_t;

/* LED统一配置表 - 案例ADC01配置（只需要LED1） */
#define LED_CONFIGS {                                                            \
    {GPIOA, GPIO_Pin_1, Bit_RESET, 1}, /* LED1：PA1，低电平点亮，启用（系统状态指示） */ \
}

/* ==================== OLED配置 ==================== */

/* OLED I2C接口类型 */
typedef enum {
    OLED_I2C_TYPE_SOFTWARE = 0,  /**< 软件I2C接口 */
    OLED_I2C_TYPE_HARDWARE = 1,  /**< 硬件I2C接口 */
} OLED_I2C_Type_t;

/* OLED I2C配置结构体（保留用于向后兼容） */
typedef struct
{
    GPIO_TypeDef *scl_port; /**< SCL引脚端口 */
    uint16_t scl_pin;       /**< SCL引脚号 */
    GPIO_TypeDef *sda_port; /**< SDA引脚端口 */
    uint16_t sda_pin;       /**< SDA引脚号 */
} OLED_I2C_Config_t;

/* OLED I2C配置 - 案例ADC01配置 */
#define OLED_I2C_CONFIG {      \
    GPIOB,                     \
    GPIO_Pin_8, /* SCL: PB8 */ \
    GPIOB,                     \
    GPIO_Pin_9, /* SDA: PB9 */ \
}

/* OLED I2C接口类型配置（默认使用软件I2C） */
#ifndef OLED_I2C_TYPE
#define OLED_I2C_TYPE OLED_I2C_TYPE_SOFTWARE
#endif

/* OLED I2C实例配置（根据接口类型选择） */
#ifndef OLED_I2C_SOFT_INSTANCE
#define OLED_I2C_SOFT_INSTANCE 0  /* SOFT_I2C_INSTANCE_1 */
#endif

#ifndef OLED_I2C_HARD_INSTANCE
#define OLED_I2C_HARD_INSTANCE 0  /* I2C_INSTANCE_1 */
#endif

/* ==================== 软件I2C配置 ==================== */

/* 软件I2C配置结构体 */
typedef struct
{
    GPIO_TypeDef *scl_port;         /**< SCL引脚端口 */
    uint16_t scl_pin;               /**< SCL引脚号 */
    GPIO_TypeDef *sda_port;         /**< SDA引脚端口 */
    uint16_t sda_pin;               /**< SDA引脚号 */
    uint32_t delay_us;              /**< I2C时序延时（微秒），建议值：5-10us（标准模式），2-5us（快速模式） */
    uint8_t enabled;                /**< 使能标志：1=启用，0=禁用 */
} SoftI2C_Config_t;

/* 软件I2C统一配置表 */
#define SOFT_I2C_CONFIGS {                                                                    \
    {GPIOB, GPIO_Pin_8, GPIOB, GPIO_Pin_9, 5, 1}, /* SoftI2C1：PB8(SCL), PB9(SDA)，5us延时，启用（OLED使用） */ \
}

#endif /* BOARD_H */


